MicrochipTech/dspic33a-high-speed-adc-example/cli.c
static void put_kv(const char *key, uint32_t v)
{
    char num[16];
    char *p = u32_to_str(num, v);
    copy_str(p, "\r\n");
    cmd_parser_write(key);
    cmd_parser_write(": ");
    cmd_parser_write(num);
}

static void put_line(const char *s)
{
    cmd_parser_write(s);
    cmd_parser_write("\r\n");
}

/* One status line, blocking, for the periodic trace from main(). */
void console_status_line(void)
{
    char line[256];                       /* 246 used with every field at max */
    char *p = copy_str(line, "[stat] blocks=");
    p = u32_to_str(p, blocks_done);
    p = copy_str(p, " overrun=");  p = u32_to_str(p, dma_overrun);
    p = copy_str(p, " late=");     p = u32_to_str(p, late_service);
    p = copy_str(p, " missed=");   p = u32_to_str(p, proc_missed);
    p = copy_str(p, " addr_err="); p = u32_to_str(p, dma_addr_err);
    p = copy_str(p, " bus_err=");  p = u32_to_str(p, dma_bus_err);
    p = copy_str(p, " last=");     p = u32_to_str(p, last_sample);
    p = copy_str(p, " input=");    p = u32_to_str(p, capture_pinsel());
    p = copy_str(p, " samc=");     p = u32_to_str(p, capture_samc());
    p = copy_str(p, " clk=");      p = u32_to_str(p, capture_clkdiv());
    p = copy_str(p, " ksps=");     p = u32_to_str(p, capture_nominal_ksps(capture_clkdiv()));
    p = copy_str(p, " run=");      p = u32_to_str(p, capture_running() ? 1u : 0u);
    p = copy_str(p, " pwr=");      p = u32_to_str(p, capture_powered() ? 1u : 0u);
    p = copy_str(p, " half=");     p = u32_to_str(p, capture_half_len());
    /* Does the ADC's channel-done event reach the CPU side at all? It is
     * the DMA trigger and stays masked (IEC6 = 0), so this flag being 1
     * while the DMA runs says the event is visible to the CPU - the
     * precondition for the vector-201 trap TROUBLESHOOTING 2.0b describes. */
    p = copy_str(p, " core=");     p = u32_to_str(p, adc_core());
    p = copy_str(p, " adif=");     p = u32_to_str(p, adc_ch0_flag() ? 1u : 0u);
    /* Receive diagnostics, see rx_count above. */
    p = copy_str(p, " rx=");       p = u32_to_str(p, rx_count);
    p = copy_str(p, " last=");     p = u32_to_hex(p, rx_last);
    p = copy_str(p, " cr=");       p = u32_to_str(p, rx_cr);
    p = copy_str(p, " lf=");       p = u32_to_str(p, rx_lf);
    copy_str(p, "\r\n");
    console_puts(line);
}

/* Decimal argument in [lo, hi]; false (and NAK) otherwise. */
static bool arg_u32(const char *s, uint32_t lo, uint32_t hi, uint32_t *out)
{
    char *end;
    unsigned long v;
    if (*s == '\0') { return false; }
    v = strtoul(s, &end, 0);
    if ((*end != '\0') || (v < lo) || (v > hi)) { return false; }
    *out = (uint32_t)v;
    return true;
}

static void usage(const char *text)
{
    cmd_parser_write("usage: ");
    put_line(text);
    cmd_parser_fail();
}

/* ------------------------------------------------------------------ *
 * Commands
 * ------------------------------------------------------------------ */
static void cmd_version_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    diag_report_build();          /* same block as at boot ([build] ...) */
    put_line("input: " BOARD_INPUT_NAME);
    put_line("console: " CONSOLE_PORT_NAME);
}
CMD_DEFINE(version, "version", cmd_version_fn, "version - build id, git revision, board, configuration");

static void cmd_status_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    put_kv("running", capture_running() ? 1u : 0u);
    put_kv("powered", capture_powered() ? 1u : 0u);
    put_kv("blocks", blocks_done);
    put_kv("overrun", dma_overrun);
    put_kv("late", late_service);
    put_kv("missed", proc_missed);
    /* The relation that decides where the lost samples come from: one
     * burst is a whole buffer, so HALF fires once and DONE once, and
     * blocks must be exactly twice bursts. A larger factor means the
     * handler books the same event repeatedly; the factor itself is the
     * measurement. Read per capture, no sweep needed. */
    put_kv("bursts", burst_starts);
    put_kv("blocks (must be 2x bursts)", blocks_done);
    put_kv("isr_entries", isr_entries);
    put_kv("half_events", half_events);
    put_kv("done_events", done_events);
    put_kv("addr_err", dma_addr_err);
    put_kv("bus_err", dma_bus_err);
    put_kv("input", capture_pinsel());
    put_kv("samc", capture_samc());
    put_kv("clkdiv (x100, read back)", capture_clkdiv());
    put_kv("clkdiv asked for", capture_clkdiv_wanted());
    put_kv("ksps nominal", capture_nominal_ksps(capture_clkdiv()));
    put_kv("adc clock Hz", clock_adc_hz());
    put_kv("last", last_sample);
    put_kv("selftest_mean", selftest_mean);
    put_kv("fail_code", fail_code);
    put_kv("rx_bytes", rx_count);
    put_kv("rx_last", rx_last);
    put_kv("rx_cr", rx_cr);
    put_kv("rx_lf", rx_lf);
}
CMD_DEFINE(status, "status", cmd_status_fn, "status - run state and counters");

static void cmd_regs_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    regs_dump();
}
CMD_DEFINE(regs, "regs", cmd_regs_fn, "regs - clock, ADC, DMA and UART registers");

static void cmd_start_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    capture_start();
    put_kv("running", 1u);
}
CMD_DEFINE(start, "start", cmd_start_fn, "start - start the burst stream");

static void cmd_stop_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    capture_stop();
    put_kv("running", 0u);
}
CMD_DEFINE(stop, "stop", cmd_stop_fn, "stop - stop after the current buffer");

static void cmd_samc_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 31u, &v)) {
        usage("samc <0..31>  (sample time (2*SAMC+0.5) TAD; the rate is set by 'period')");
        return;
    }
    (void)capture_set_input(capture_pinsel(), (uint8_t)v);
    put_kv("samc", v);
}
CMD_DEFINE(samc, "samc", cmd_samc_fn, "samc <0..31> - sample time in TAD steps");

static void cmd_input_fn(int argc, char **argv)
{
    uint32_t v;
    if ((argc != 2) || !arg_u32(argv[1], 0u, 15u, &v)) {
        usage("input <0..15>  (PINSEL of the ADC core, 6 = internal 15/16 VDD)");
        return;
    }
    (void)capture_set_input((uint8_t)v, capture_samc());
    put_kv("input", v);
}
CMD_DEFINE(input, "input", cmd_input_fn, "input <0..15> - analog input (PINSEL)");

static void cmd_core_fn(int argc, char **argv)
{
    uint32_t core, pinsel = ADC_PINSEL;
    if ((argc < 2) || (argc > 3) || !arg_u32(argv[1], 1u, 5u, &core) ||
        ((argc == 3) && !arg_u32(argv[2], 0u, 15u, &pinsel))) {
        usage("core <1..5> [pinsel]  (switch the ADC core; 5 3 = DAC2's pin RA8)");
        return;
    }
    if (!capture_select_core((uint8_t)core, (uint8_t)pinsel, capture_samc())) { cmd_parser_fail(); return; }
    put_kv("core", core);
    put_kv("input", pinsel);
}
CMD_DEFINE(core, "core", cmd_core_fn, "core <1..5> [pinsel] - switch the ADC core");

static void cmd_buf_fn(int argc, char **argv)
{
    uint32_t n;
    if (argc == 1) {
        put_kv("samples per half", capture_half_len());
        put_kv("maximum", SAMPLES_PER_HALF_MAX);
        return;
    }
    if ((argc != 2) || !arg_u32(argv[1], SAMPLES_PER_HALF_MIN, SAMPLES_PER_HALF_MAX, &n)) {
        usage("buf [samples per half 16..1024]  (stop first; the next start uses the new size)");
        return;
    }
    if (!capture_set_half_len(n)) {
        put_line("buf: stop the stream first");
        cmd_parser_fail();
        return;
    }
    put_kv("samples per half", capture_half_len());
}
CMD_DEFINE(buf, "buf", cmd_buf_fn, "buf [n] - samples per buffer half (16..1024)");

static void cmd_dac_fn(int argc, char **argv)
{
    uint32_t unit, low = 0x100u, high = 0xF00u, slp = 8u;
    if ((argc < 3) || !arg_u32(argv[1], 1u, DAC_UNITS, &unit)) {
        usage("dac <1|2> <on|off> [low] [high] [slpdat]  (triangle on DACOUT1 = RA1 or DACOUT2 = RA8)");
        return;
    }
    if ((argv[2][0] == 'o') && (argv[2][1] == 'f')) {
        dac_off((uint8_t)unit);
        put_kv("dac", unit);
        put_line("off");
        return;
    }
    if ((argv[2][0] != 'o') || (argv[2][1] != 'n') || (argc > 6) ||
        ((argc >= 4) && !arg_u32(argv[3], 0u, 4095u, &low)) ||
        ((argc >= 5) && !arg_u32(argv[4], 0u, 4095u, &high)) ||
        ((argc == 6) && !arg_u32(argv[5], 1u, 255u, &slp)) ||
        (high <= low)) {
        usage("dac <1|2> <on|off> [low] [high] [slpdat]  (0..4095, high > low, slpdat 1..255)");
        return;
    }
    if (!dac_triangle_start((uint8_t)unit, (uint16_t)low, (uint16_t)high, (uint16_t)slp)) {
        put_line("dac: refused - SLPDAT above 50 breaks the 0xCD+SLPDAT..0xF32-SLPDAT limits, or CLKGEN7 did not come up");
        cmd_parser_fail();
        return;
    }
    put_kv("dac", unit);
    put_line(dac_pin_name((uint8_t)unit));
    put_kv("low", low);
    put_kv("high", high);
    put_kv("slpdat", slp);
    put_kv("period ns", dac_period_ns((uint8_t)unit));
}
CMD_DEFINE(dac, "dac", cmd_dac_fn, "dac <1|2> <on|off> [low] [high] [slpdat] - triangle on DACOUT1/2");

/* The DAC test measures the DAC inside the chip: UREFCON puts DAC2 on
 * the UREF line and the ADC samples it as AN7, which every core has
 * (board.h). So no core is switched and no pin is involved - run 10 ran
 * the test on core 3 against RA8, which belongs to core 5, and measured
 * an open pin. The input in use is restored afterwards, so a "dactest"
 * from the console does not silently leave the measurement elsewhere. */
static uint32_t run_dactest(uint32_t bursts)
{
    const uint8_t pinsel_before = capture_pinsel();
    const uint8_t samc_before   = capture_samc();

    if (!uref_route_dac2(false)) {
        put_line("dactest: UREFCON did not take the DAC2 selection");
        return 1u;
    }
    console_kv("[dactest] DAC2 routed to the internal UREF line, INSEL", uref_insel());
    console_kv("[dactest]   measured on this core's AN7, ADC core", adc_core());
    if (!capture_set_input(DAC_UREF_PINSEL, samc_before)) {
        put_line("dactest: could not select the UREF input");
        uref_off();
        return 1u;
    }
    const uint32_t rc = dactest_run(bursts);
    (void)capture_set_input(pinsel_before, samc_before);
    uref_off();
    return rc;
}

static void cmd_dactest_fn(int argc, char **argv)
{
    uint32_t halves = 64u;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 1u, 10000u, &halves))) {
        usage("dactest [halves]  (capture and judge the DAC2 triangle, default 64 halves)");
        return;
    }
    if (run_dactest(halves) != 0u) { cmd_parser_fail(); }
}
CMD_DEFINE(dactest, "dactest", cmd_dactest_fn, "dactest [halves] - judge the running DAC's triangle through the chain");

static void cmd_selftest_fn(int argc, char **argv)
{
    uint32_t mean = 0;
    (void)argc; (void)argv;
    const uint32_t rc = capture_selftest(&mean);
    put_kv("selftest_mean", mean);
    if (rc == 0u)      { put_line("selftest: ok (3648..4032)"); }
    else if (rc == 6u) { put_line("selftest: no data - is the stream running?"); }
    else if (rc == 7u) { put_line("selftest: mean outside 3648..4032"); }
    else               { put_line("selftest: DMA channel disabled (address fault?)"); }
    if (rc != 0u) { cmd_parser_fail(); }
}
CMD_DEFINE(selftest, "selftest", cmd_selftest_fn, "selftest - sample the internal reference");

/* min/max/mean/pp of the completed half - shared by "stats" and the
 * periodic [half] line. */
static void half_stats(uint32_t *mn, uint32_t *mx, uint32_t *mean)
{
    const volatile uint16_t *b = capture_completed_half();
    uint32_t lo = 0xFFFFu, hi = 0u, acc = 0u;
    const uint32_t n = capture_half_len();
    for (uint32_t i = 0; i < n; i++) {
        const uint16_t v = b[i];
        if (v < lo) { lo = v; }
        if (v > hi) { hi = v; }
        acc += v;
    }
    *mn = lo; *mx = hi; *mean = acc / n;
}

void console_half_stats(void)
{
    char line[96];
    uint32_t mn, mx, mean;
    half_stats(&mn, &mx, &mean);
    char *p = copy_str(line, "[half] n=");
    p = u32_to_str(p, ready_half);
    p = copy_str(p, " min=");  p = u32_to_str(p, mn);
    p = copy_str(p, " max=");  p = u32_to_str(p, mx);
    p = copy_str(p, " mean="); p = u32_to_str(p, mean);
    p = copy_str(p, " pp=");   p = u32_to_str(p, mx - mn);
    copy_str(p, "\r\n");
    console_puts(line);
}

static void cmd_stats_fn(int argc, char **argv)
{
    uint32_t mn, mx, mean;
    (void)argc; (void)argv;
    half_stats(&mn, &mx, &mean);
    put_kv("half", ready_half);
    put_kv("min", mn);
    put_kv("max", mx);
    put_kv("mean", mean);
    put_kv("pp", mx - mn);
}
CMD_DEFINE(stats, "stats", cmd_stats_fn, "stats - min/max/mean of the completed half");

static void cmd_dump_fn(int argc, char **argv)
{
    /* The WHOLE buffer, not one half. After "snap" the buffer holds one
     * contiguous window that nothing is writing any more, and that is the
     * only thing worth plotting or transforming - a half read out while
     * the stream runs is torn, because at these rates the main loop is
     * milliseconds behind the DMA (docs/HARDWARE-LOG.md run 11). */
    const uint32_t total = 2u * capture_half_len();
    uint32_t count = 64u, offset = 0u;
    if ((argc > 3) ||
        ((argc >= 2) && !arg_u32(argv[1], 1u, total, &count)) ||
        ((argc == 3) && !arg_u32(argv[2], 0u, total - 1u, &offset))) {
        usage("dump [count 1..2048] [offset 0..2047]  (the whole buffer; use snap first)");
        return;
    }
    if ((offset + count) > total) {
        count = total - offset;
    }
    const volatile uint16_t *b = capture_buffer();
    char line[80];
    for (uint32_t i = 0; i < count; i += 8u) {
        char *p = line;
        /* "nnnn:" index, then up to eight values */
        uint32_t idx = offset + i;
        for (int d = 3; d >= 0; d--) { p[d] = (char)('0' + idx % 10u); idx /= 10u; }
        p += 4; *p++ = ':';
        for (uint32_t k = 0; (k < 8u) && (i + k < count); k++) {
            *p++ = ' ';
            p = u32_to_str(p, b[offset + i + k]);
        }
        copy_str(p, "\r\n");
        cmd_parser_write(line);
        if (cmd_parser_aborted()) { return; }
    }
}
CMD_DEFINE(dump, "dump", cmd_dump_fn, "dump [count] [offset] - samples of the buffer (snap first)");

static void cmd_clear_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    counters_clear();
    put_line("counters cleared");
}
CMD_DEFINE(clear, "clear", cmd_clear_fn, "clear - zero the error counters");

static void cmd_led_fn(int argc, char **argv)
{
    if (argc == 2) {
        if (strcmp(argv[1], "on") == 0)   { led_mode(1u); put_line("led: on");   return; }
        if (strcmp(argv[1], "off") == 0)  { led_mode(0u); put_line("led: off");  return; }
        if (strcmp(argv[1], "auto") == 0) { led_mode(2u); put_line("led: auto"); return; }
    }
    usage("led on|off|auto");
}
CMD_DEFINE(led, "led", cmd_led_fn, "led on|off|auto - LED0");

/* ------------------------------------------------------------------ *
 * sweep - the rate measurement, automated
 *
 * For each divide ratio of the ladder (capture.c), slowest rate first,
 * three runs of `halves` halves: the CPU idle, the CPU doing the
 * main-loop processing, and the CPU polling an SFR. The counters after
 * each run say whether the DMA kept up (overrun) and whether the CPU
 * got every half (missed). The clock is switched once per row and read
 * back; a row whose switch did not arrive prints that and no numbers.
 * Three times per rate, with the CPU doing something different while
 * the DMA runs, because the first board run could not tell whether the
 * overruns come from the DMA bus itself or from the CPU competing for
 * it (DS70005591D 13.4.4, one shared DMA data bus):
 *
 *   idle     the CPU polls blocks_done, a RAM variable, nothing else
 *   process  the CPU runs capture_service(), i.e. process_buffer() on
 *            every completed half - what the application would do
 *   sfr      the CPU reads U2STAT in a tight loop - the worst case, a
 *            CPU that hammers the peripheral bus (the console does this
 *            while it prints)
 *
 * One line per rate. overrun must be 0 for a rate to be usable. The
 * whole sweep runs inside the receive interrupt, like every command;
 * the DMA interrupt preempts it, the main loop is starved meanwhile
 * (counters are cleared afterwards, so that does not show up). The
 * previous sample time and run state are restored at the end.
 * ------------------------------------------------------------------ */
#define SWEEP_HALVES_DEFAULT  2000u          /* 2 M samples per point   */
#define SWEEP_WAIT_LIMIT      400000000u     /* loop iterations, ~10 s  */

/* The MEASURED rate comes from timebase.c (Timer1 at 12.5 MHz). The rate
 * the first board sweep printed was the nominal 40/(SAMC+1); the counters
 * said it was not what the ADC did (equal overruns at every "rate",
 * halves missed at 1.25 MSPS), so from then on the sweep measures. */

enum sweep_load { SWEEP_IDLE = 0, SWEEP_PROCESS = 1, SWEEP_SFR = 2 };

/* Run `halves` halves at `samc` with the CPU under `load` meanwhile.
 * *ticks receives the Timer1 ticks the halves took. Returns false if
 * the stream stopped or never delivered. */
static bool sweep_point(uint32_t halves, enum sweep_load load, uint32_t *ticks)
{
    uint32_t n = SWEEP_WAIT_LIMIT;
    (void)capture_settle();                                   /* defined start     */
    counters_clear();
    const uint32_t target = blocks_done + halves;
    const uint32_t t0 = timebase_ticks();
    capture_start();
    n = SWEEP_WAIT_LIMIT;
    while (blocks_done < target) {
        SIM_DMA_TICK();
        if (load == SWEEP_PROCESS)      { (void)capture_service(); }
        else if (load == SWEEP_SFR)     { (void)U2STAT; }
        /* The brake fired: this rate floods the CPU with overrun
         * interrupts and is unusable. Not an error of the point. */
        if (capture_overrun_aborted()) { (void)capture_settle(); return false; }
        if (--n == 0u) { (void)capture_settle(); return false; }
    }
    *ticks = timebase_ticks() - t0;   /* unsigned: wrap-safe             */
    (void)capture_settle();           /* point over: DMA down            */
    return true;
}

/* Returns true if the process run delivered every half with no overrun. */
static bool sweep_row(struct pll_step st, uint32_t halves)
{
    /* The clock is switched once for the row, not once per load: the
     * three loads differ in what the CPU does, not in the rate. If the
     * switch does not arrive, the row says so and no number is printed -
     * a measured rate under an unknown divider is what made run 7
     * unreadable. */
    const uint32_t rc = capture_set_pll(st.p1, st.p2);
    if (rc != CLKDIV_OK) {
        /* Two single digits plus the longest error text of about 50:
         * well inside 144. */
        char bad[144];
        char *q = copy_str(bad, "postdiv ");  q = u32_to_str(q, st.p1);
        *q++ = '/';                           q = u32_to_str(q, st.p2);
        q = copy_str(q, ": clock switch FAILED - ");
        q = copy_str(q, clock_adc_div_error(rc));
        copy_str(q, "\r\n");
        console_puts(bad);
        return false;
    }

    /* The rate, measured on ONE burst with nothing else running. The
     * three loaded runs below cannot measure it: at a rate that overruns,
     * the CPU drowns in the overrun interrupt and the loaded figure came
     * out ten times too high at every setting (runs 8 to 11 reported
     * 42 MSPS everywhere, while a clean burst at the same setting
     * measured 3990 ksps against 4081 nominal - run 13). Both are printed,
     * because the difference is the artefact. */
    uint32_t clean_ksps = 0u, clean10_ksps = 0u;
    {
        const uint32_t nn = 2u * capture_half_len();
        /* Ten bursts as well as one. In run 16 a single burst delivered
         * the rate the PLL was set to and a thousand delivered 40 MSPS at
         * every setting; ten bursts sit between the two and say which of
         * them a burst in a stream resembles. */
        if (capture_oneshot_n(10u) == 0u) {
            clean10_ksps = timebase_ksps(10u * nn, capture_oneshot_ticks());
        }
        (void)capture_settle();
        if (capture_oneshot() == 0u) {
            /* The burst alone - capture_oneshot_ticks() excludes the DMA
             * teardown and setup, whose fixed 11.3 us used to make every
             * rate read low, by 2.2 % at 4 MSPS and 17.8 % at 40 (run 14). */
            clean_ksps = timebase_ksps(nn, capture_oneshot_ticks());
        }
        (void)capture_settle();
    }

    uint32_t ov[3], ticks[3] = { 0, 0, 0 };
    bool     ok[3];
    uint32_t late = 0, missed = 0;
    for (int l = 0; l < 3; l++) {
        ok[l] = sweep_point(halves, (enum sweep_load)l, &ticks[l]);
        ov[l] = dma_overrun;
        if (l == SWEEP_PROCESS) { late = late_service; missed = proc_missed; }
    }
    /* Measured rate of the idle run. */
    const uint32_t meas_ksps = ok[0] ? timebase_ksps(halves * capture_half_len(), ticks[0]) : 0u;
    /* Longest line: 150 characters plus NUL; every number is at most
     * 10 digits, "STOPPED" is shorter. */
    char line[208];
    char *p = copy_str(line, "postdiv ");      p = u32_to_str(p, st.p1);
    *p++ = '/';                                p = u32_to_str(p, st.p2);
    p = copy_str(p, "  adc clock Hz ");        p = u32_to_str(p, clock_adc_hz());
    p = copy_str(p, "  ksps nom ");            p = u32_to_str(p, capture_nominal_ksps(0u));
    p = copy_str(p, " clean1 ");               p = u32_to_str(p, clean_ksps);
    p = copy_str(p, " clean10 ");              p = u32_to_str(p, clean10_ksps);
    p = copy_str(p, " loaded ");               p = u32_to_str(p, meas_ksps);
    p = copy_str(p, "  overrun idle/process/sfr ");
    for (int l = 0; l < 3; l++) {
        if (l) { *p++ = '/'; }
        p = ok[l] ? u32_to_str(p, ov[l]) : copy_str(p, "STOPPED");
    }
    p = copy_str(p, "  late ");               p = u32_to_str(p, late);
    p = copy_str(p, "  missed ");             p = u32_to_str(p, missed);
    copy_str(p, "\r\n");
    console_puts(line);               /* blocking: works from main() too */

    /* The three numbers that answer why there are overruns at 4 MSPS,
     * where the DMA has eight times the headroom it needs, and why the
     * loaded rate reads ten times the clean one. From the process run.
     * half + done must equal the halves counted; if half is of the order
     * of the overrun count instead, the status flags are not clearing and
     * the handler is booking the same event over and over - our bug, not
     * the silicon's. */
    /* blocks_done is NOT reset by counters_clear() - it is free running,
     * so printing it raw next to per-point counters compared a total
     * against a sample and made the relation unreadable (run 16). The
     * delta over this point is what belongs beside them. */
    char c2[144];
    char *q = copy_str(c2, "[sweep]   isr ");  q = u32_to_str(q, isr_entries);
    q = copy_str(q, "  half ");                q = u32_to_str(q, half_events);
    q = copy_str(q, "  done ");                q = u32_to_str(q, done_events);
    q = copy_str(q, "  bursts ");             q = u32_to_str(q, burst_starts);
    q = copy_str(q, "  half+done ");          q = u32_to_str(q, half_events + done_events);
    q = copy_str(q, " (must be 2x bursts)");
    copy_str(q, "\r\n");
    console_puts(c2);
    return ok[SWEEP_PROCESS] && (ov[SWEEP_PROCESS] == 0u) && (missed == 0u) && (late == 0u);
}

