MicrochipTech/dspic33a-high-speed-adc-example/cli.c
/* One rate point: select, run one clean burst, report. */
static bool matrix_point(capture_variant_t v, uint32_t want, bool show_regs)
{
    if (!capture_select_variant(v, want)) {
        console_kv("[matrix]   could not configure for ksps", want);
        return false;
    }
    if (show_regs) { capture_variant_regs(); }

    const uint32_t nominal = capture_variant_ksps();
    const uint32_t n     = 2u * capture_half_len();
    const uint32_t rc    = capture_oneshot();
    const uint32_t ticks = capture_oneshot_ticks();   /* the burst alone */
    (void)capture_settle();

    if (rc != 0u) {
        console_kv("[matrix]   ksps asked", want);
        console_puts("[matrix]     NO DATA - nothing converted\r\n");
        return false;
    }
    const uint32_t ksps = timebase_ksps(n, ticks);
    const uint32_t diff = (ksps > nominal) ? (ksps - nominal) : (nominal - ksps);
    const bool     ok   = (nominal != 0u) && (diff <= (nominal * MATRIX_TOL_PCT / 100u));

    /* Longest line: four numbers of at most 10 digits and about 70
     * characters of text, well inside 160. */
    char line[160];
    char *q = copy_str(line, "[matrix]   asked ");  q = u32_to_str(q, want);
    q = copy_str(q, "  nominal ");                  q = u32_to_str(q, nominal);
    q = copy_str(q, "  measured ");                 q = u32_to_str(q, ksps);
    q = copy_str(q, " ksps  -> ");
    q = copy_str(q, ok ? "follows" : "DOES NOT FOLLOW");
    copy_str(q, "\r\n");
    console_puts(line);

    /* Transfers per trigger, for the triggered variants: the trigger
     * period is exact, the transfer count is exactly one buffer, and the
     * window came from Timer1. */
    const uint32_t trig_ns = capture_trigger_period_ns();
    if ((trig_ns != 0u) && (ticks != 0u)) {
        const uint32_t window_ns = (uint32_t)(((uint64_t)ticks * 1000000000ull) / TIMEBASE_HZ);
        const uint32_t triggers  = window_ns / trig_ns;
        if (triggers != 0u) {
            console_kv("[matrix]     triggers in the window", triggers);
            console_kv("[matrix]     transfers per trigger x100", (n * 100u) / triggers);
        }
    }
    console_kv("[matrix]     overrun during the burst", dma_overrun);
    return ok;
}

static void cmd_matrix(void)
{
    struct matrix_result res[CAP_VAR_COUNT];
    console_puts("\r\n[matrix] every documented way to set the sample rate, tried on the board\r\n"
                 "[matrix] rate measured on one clean burst per point, never under load\r\n"
                 "[matrix] see sccp.h for the three errors this replaces\r\n");

    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        res[v].converts = false;
        res[v].rate_follows = false;
        res[v].streams = false;
        res[v].checked = false;
        res[v].stream_ksps = 0u;

        console_puts("\r\n[matrix] ");
        console_puts(capture_variant_name((capture_variant_t)v));
        console_puts("\r\n");

        uint32_t good = 0u;
        for (uint32_t i = 0; i < MATRIX_POINTS; i++) {
            if (matrix_point((capture_variant_t)v, matrix_ksps[i], i == 0u)) { good++; }
            if (blocks_done != 0u) { res[v].converts = true; }
        }
        res[v].rate_follows = (good == MATRIX_POINTS);
        console_puts(res[v].rate_follows
                     ? "[matrix]   VERDICT: the rate follows at every point\r\n"
                     : "[matrix]   VERDICT: not usable as a rate control\r\n");
    }

    /* ---- the acceptance test: does it stream, with the CPU keeping up?
     * Run for every variant that converted at all, not only for those
     * whose rate followed - a variant could stream cleanly at a rate
     * that is not the one asked for, and that is worth knowing. Two
     * points: the slowest, where it is most likely to work, and 8 MSPS. */
    console_puts("\r\n[matrix] THE ACCEPTANCE TEST: a lasting stream with the CPU processing\r\n"
                 "[matrix] overrun, late and missed must all be zero - missed above zero means\r\n"
                 "[matrix] the CPU never saw a half, which is the whole point of the example\r\n");
    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        if (!res[v].converts) { continue; }
        console_puts("\r\n[matrix] ");
        console_puts(capture_variant_name((capture_variant_t)v));
        console_puts("\r\n");
        uint32_t k = 0u;
        const bool slow = matrix_stream((capture_variant_t)v, MATRIX_STREAM_SLOW,
                                        MATRIX_STREAM_HALVES, &k);
        uint32_t k8 = 0u;
        const bool at8 = matrix_stream((capture_variant_t)v, MATRIX_STREAM_TARGET,
                                       MATRIX_STREAM_HALVES, &k8);
        res[v].streams     = slow || at8;
        res[v].stream_ksps = at8 ? k8 : k;
    }

    /* The data check, only for what streams - a clean stream that
     * carries the wrong samples would be the worst outcome of all. */
    console_puts("\r\n[matrix] data check on the variants that streamed cleanly\r\n");
    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        if (!res[v].streams) { continue; }
        console_puts("[matrix] ");
        console_puts(capture_variant_name((capture_variant_t)v));
        console_puts("\r\n");
        if (capture_select_variant((capture_variant_t)v, 8000u)) {
            /* Once as an isolated burst and once as the hundredth of a
             * stream. The triangle's period cannot change, so period in
             * samples divided by rate must agree; if it does not, the
             * samples in the stream are repeats. */
            console_puts("[matrix]   isolated burst:\r\n");
            const bool one = (run_dactest(1u) == 0u);
            console_puts("[matrix]   the 100th burst of a stream:\r\n");
            const bool hundred = (run_dactest(100u) == 0u);
            res[v].checked = one && hundred;
        }
    }

    console_puts("\r\n[matrix] SUMMARY - the last column is the one the example lives on\r\n");
    uint32_t winner = (uint32_t)CAP_VAR_COUNT;
    for (uint32_t v = 0; v < (uint32_t)CAP_VAR_COUNT; v++) {
        char line[176];
        char *q = copy_str(line, "[matrix]   ");
        q = copy_str(q, res[v].rate_follows ? "RATE OK  " : "         ");
        q = copy_str(q, res[v].checked      ? "DATA OK  " : "         ");
        q = copy_str(q, res[v].streams      ? "STREAMS  " : "         ");
        q = copy_str(q, capture_variant_name((capture_variant_t)v));
        copy_str(q, "\r\n");
        console_puts(line);
        if (res[v].streams && res[v].checked && (winner == (uint32_t)CAP_VAR_COUNT)) {
            winner = v;
        }
    }
    if (winner != (uint32_t)CAP_VAR_COUNT) {
        console_puts("[matrix] USE THIS ONE: ");
        console_puts(capture_variant_name((capture_variant_t)winner));
        console_puts("\r\n[matrix]   it streams without losing a sample, the CPU keeps up,\r\n"
                     "[matrix]   and the data arrive complete and in order\r\n");
    } else {
        console_puts("[matrix] NONE of the variants streams cleanly with the CPU keeping up.\r\n"
                     "[matrix]   That is the example's central claim, so until one does, the\r\n"
                     "[matrix]   example does not demonstrate what it says it demonstrates.\r\n");
    }
    /* Back to a known state: the boot setting. */
    (void)capture_select_variant(CAP_VAR_B2B, capture_nominal_ksps(0u));
    (void)capture_set_pll(ADC_PLL_POSTDIV1, ADC_PLL_POSTDIV2);
    console_puts("[matrix] done - back at the boot setting\r\n");
}

/* ------------------------------------------------------------------ *
 * "test bursts" - does the rate depend on how many bursts run?
 *
 * The single measurement that names the contradiction of run 16. One
 * burst at a given setting delivers the rate that was asked for; a
 * thousand bursts at the same setting delivered about 40 MSPS whatever
 * the setting was. Nothing in between had ever been measured, so the two
 * observations sat next to each other with no bridge.
 *
 * capture_oneshot_n() builds the bridge: it restarts each burst from the
 * DMA interrupt exactly as continuous streaming does, and stops after
 * the count given. Reading the rate at one, ten and a hundred bursts at
 * the same clock setting says which of the two pictures a burst in a
 * stream belongs to - and if the rate climbs with the count, it says how
 * quickly.
 * ------------------------------------------------------------------ */
static void test_bursts(void)
{
    static const uint32_t counts[] = { 1u, 10u, 100u };
    static const uint32_t rates[]  = { 4000u, 8000u, 20000u };

