MicrochipTech/dspic33a-high-speed-adc-example/cli.c
    console_puts("[test] bursts: the same setting, measured over 1, 10 and 100 bursts\r\n"
                 "[test]   each burst is restarted from the DMA interrupt, as streaming does\r\n"
                 "[test]   a rate that climbs with the count is the bridge between run 16's\r\n"
                 "[test]   single burst (the setting) and its thousand (40 MSPS regardless)\r\n");

    for (uint32_t r = 0; r < (sizeof rates / sizeof rates[0]); r++) {
        if (!capture_select_variant(CAP_VAR_B2B, rates[r])) { continue; }
        const uint32_t nominal = capture_variant_ksps();
        const uint32_t n       = 2u * capture_half_len();
        console_kv("[test]   nominal ksps", nominal);
        for (uint32_t c = 0; c < (sizeof counts / sizeof counts[0]); c++) {
            const uint32_t rc = capture_oneshot_n(counts[c]);
            const uint32_t tk = capture_oneshot_ticks();
            (void)capture_settle();
            char line[144];
            char *q = copy_str(line, "[test]     bursts ");  q = u32_to_str(q, counts[c]);
            q = copy_str(q, ": ");
            if (rc != 0u) {
                q = copy_str(q, "no data");
            } else {
                q = copy_str(q, "ksps ");
                q = u32_to_str(q, timebase_ksps(counts[c] * n, tk));
                q = copy_str(q, "  overrun ");
                q = u32_to_str(q, dma_overrun);
            }
            copy_str(q, "\r\n");
            console_puts(line);
        }
    }
    console_puts("[test] bursts: done - equal rates mean a burst in a stream is an ordinary\r\n"
                 "[test]   burst; a rising rate means it is not, and the single-burst figures\r\n"
                 "[test]   measured so far describe a start-up rather than the stream\r\n");
}

static void test_list(void)
{
    put_line("test all   [halves]  - self, clock, sweep, dac in that order");
    put_line("test self            - ADC -> DMA -> RAM on the internal reference");
    put_line("test clock           - switch every CLKGEN6 ratio and read it back");
    put_line("test clkoff          - switch CLKGEN6 off: does the ADC still convert?");
    put_line("test matrix          - every way to set the rate, tried and measured");
    put_line("test bursts          - does the rate depend on how many bursts run?");
    put_line("test rate  [halves]  - delivered rate at the ratio set now");
    put_line("test sweep [halves]  - the rate ladder, slowest first, with the counters");
    put_line("test dac   [halves]  - the DAC2 triangle: is everything there, in order?");
    put_line("pll <p1> <p2> sets the rate by hand; clk sets the (ineffective) CLKGEN6");
    put_line("ratio; regs prints the registers");
}

static void cmd_test_fn(int argc, char **argv)
{
    uint32_t halves = 0u;                  /* 0 = the part's own default */
    if (argc == 1) { test_list(); return; }
    chain_stream_off();                    /* the tests need the boot setup */
    if (argc > 3) { usage("test <all|self|clock|clkoff|bursts|matrix|rate|sweep|dac> [n]"); return; }
    if ((argc == 3) && !arg_u32(argv[2], 1u, 100000u, &halves)) {
        usage("test <all|self|clock|clkoff|bursts|matrix|rate|sweep|dac> [n]");
        return;
    }
    const char *what = argv[1];

    if (strcmp(what, "self") == 0) {
        if (!test_self()) { cmd_parser_fail(); }
    } else if (strcmp(what, "clock") == 0) {
        if (!test_clock()) { cmd_parser_fail(); }
    } else if (strcmp(what, "clkoff") == 0) {
        if (!test_clkoff()) { cmd_parser_fail(); }
    } else if (strcmp(what, "matrix") == 0) {
        cmd_matrix();
    } else if (strcmp(what, "bursts") == 0) {
        test_bursts();
    } else if (strcmp(what, "rate") == 0) {
        if (!test_rate((halves != 0u) ? halves : TEST_RATE_HALVES)) { cmd_parser_fail(); }
    } else if (strcmp(what, "sweep") == 0) {
        (void)test_sweep((halves != 0u) ? halves : TEST_SWEEP_HALVES);
    } else if (strcmp(what, "dac") == 0) {
        if (!test_dac((halves != 0u) ? halves : TEST_DAC_HALVES)) { cmd_parser_fail(); }
    } else if (strcmp(what, "all") == 0) {
        console_puts("\r\n[test] ALL - self, clock, sweep, dac\r\n");
        (void)capture_set_clkdiv(ADC_CLKDIV);      /* start slow          */
        const bool self_ok = test_self();
        if (!self_ok) {
            /* The only part whose failure stops the rest: without a
             * working chain every number after it is meaningless. */
            console_puts("[test] ALL: STOPPED - the chain itself does not work\r\n");
            cmd_parser_fail();
            return;
        }
        const bool clock_ok = test_clock();
        (void)test_clkoff();
        /* The bridge between one burst and a thousand, and then every
         * variant with the acceptance test behind it. This is the run
         * that is meant to answer everything at once, because a board
         * run costs a person. */
        test_bursts();
        (void)test_sweep((halves != 0u) ? halves : TEST_SWEEP_HALVES);
        cmd_matrix();
        const bool dac_ok = test_dac(1u);
        console_puts("\r\n[test] ALL DONE\r\n");
        console_puts(self_ok  ? "[test]   self:  PASS\r\n" : "[test]   self:  FAIL\r\n");
        console_puts(clock_ok ? "[test]   clock: PASS\r\n" : "[test]   clock: FAIL\r\n");
        console_puts("[test]   sweep: see the table above\r\n");
        console_puts(dac_ok   ? "[test]   dac:   PASS\r\n" : "[test]   dac:   FAIL\r\n");
        if (!clock_ok || !dac_ok) { cmd_parser_fail(); }
    } else {
        test_list();
        cmd_parser_fail();
    }
}
CMD_DEFINE(test, "test", cmd_test_fn, "test [all|self|clock|clkoff|bursts|matrix|rate|sweep|dac] [n]");

/* The chain test (chaintest.c). "chain all" is the one command the
 * person at the board types; the rest is for repeating a part. */
static void cmd_chain_fn(int argc, char **argv)
{
    static const char use[] = "chain all | chain <0..9> | chain from <0..9> | chain run <ksps> [seconds]";
    uint32_t a = 0u, b = 0u;
    if ((argc == 2) && (strcmp(argv[1], "all") == 0)) {
        chain_all(0u, 9u);
    } else if ((argc == 3) && (strcmp(argv[1], "from") == 0) && arg_u32(argv[2], 0u, 9u, &a)) {
        chain_all(a, 9u);
    } else if ((argc == 2) && arg_u32(argv[1], 0u, 9u, &a)) {
        chain_all(a, a);
    } else if (((argc == 3) || (argc == 4)) && (strcmp(argv[1], "run") == 0) &&
               arg_u32(argv[2], 1u, 40000u, &a) &&
               ((argc == 3) || arg_u32(argv[3], 1u, 3600u, &b))) {
        chain_run(a, (argc == 4) ? b : 10u);
    } else {
        usage(use);
    }
}
CMD_DEFINE(chain, "chain", cmd_chain_fn, "chain all|<n>|from <n>|run <ksps> [s] - the chain test");

/* "stream grab": one halt/transfer/restart cycle of the standing stream,
 * defined below (BLK_CHUNK, crc16) - forward-declared here to keep the
 * "on|off|grab|<report>" dispatch together in one function. */
static void cmd_stream_grab(void);

