MicrochipTech/dspic33a-high-speed-adc-example/cli.c
/* The chain as the example runs it (chaintest.c): "stream on <ksps>"
 * starts it and returns - main() processes every half from then on -
 * "stream" reports, "stream off" stops, "stream grab" halts it just long
 * enough to send one contiguous window to the GUI and restarts it (own
 * binary frame, see cmd_stream_grab() below). The report is a snapshot
 * taken first and printed afterwards; printing takes the CPU from main()
 * for a few milliseconds, so at high rates each "stream" costs some
 * halves, which then show in the NEXT report's missed count. */
static void cmd_stream_fn(int argc, char **argv)
{
    static const char use[] = "stream on <ksps 1..40000> | stream off | stream grab | stream";
    uint32_t k = 0u;
    if ((argc == 3) && (strcmp(argv[1], "on") == 0) && arg_u32(argv[2], 1u, 40000u, &k)) {
        if (!chain_stream_on(k)) { put_line("stream: set-up failed (clock, core or trigger) - run 'chain 0'"); cmd_parser_fail(); return; }
    } else if ((argc == 2) && (strcmp(argv[1], "off") == 0)) {
        chain_stream_off();
        put_line("stream: off, boot configuration restored");
        return;
    } else if ((argc == 2) && (strcmp(argv[1], "grab") == 0)) {
        cmd_stream_grab();
        return;
    } else if (argc != 1) {
        usage(use);
        return;
    }
    uint32_t ksps = 0u, free_cyc = 0u;
    uint64_t xfer = 0u;
    if (!chain_streaming()) { put_line("stream: off"); return; }
    const bool running = chain_stream_state(&ksps, &xfer, &free_cyc);
    /* snapshot, then print */
    const uint32_t halves = blocks_done, ov = dma_overrun, la = late_service, mi = proc_missed;
    const uint32_t pmax = proc_ticks_max;
    const bool brake = capture_overrun_aborted();
    uint32_t mn = 0u, mx = 0u, mean = 0u;
    half_stats(&mn, &mx, &mean);
    put_line(running ? "stream: on - SCCP1 -> ADC core 5 (RA8, DAC2 triangle) -> DMA0 -> ping-pong -> main()"
                     : "stream: STOPPED by itself - the overrun brake fired, the rate is not usable");
    put_kv("ksps", ksps);
    put_kv("seconds", (ksps != 0u) ? (uint32_t)(xfer / ((uint64_t)ksps * 1000u)) : 0u);
    put_kv("transfers (millions)", (uint32_t)(xfer / 1000000u));
    put_kv("halves", halves);
    put_kv("overrun", ov);
    put_kv("late", la);
    put_kv("missed", mi);
    put_kv("brake", brake ? 1u : 0u);
    put_kv("processing max per half, us", (pmax * 8u + 50u) / 100u);   /* 80 ns ticks */
    put_kv("free CPU cycles per sample (mean)", free_cyc);
    put_kv("last half min", mn);
    put_kv("last half max", mx);
    put_kv("last half mean", mean);
}
CMD_DEFINE(stream, "stream", cmd_stream_fn, "stream on <ksps>|off|grab - the chain streaming, main() processing, one halt/transfer/restart cycle");

static void cmd_snap_fn(int argc, char **argv)
{
    (void)argc; (void)argv;
    /* One buffer, and the DMA interrupt ends the stream itself. This is
     * the only way to get a coherent window at a rate where the main loop
     * cannot keep up: "start, wait, stop, dump" reads a half that the DMA
     * has overwritten a thousand times in the meantime, and at a rate
     * with overruns the "stop" never even arrives, because the console's
     * receive interrupt sits below the DMA channel. Afterwards the whole
     * buffer stands still and "dump" can read all of it. */
    const uint32_t n     = 2u * capture_half_len();
    const uint32_t t0    = timebase_ticks();
    const uint32_t rc    = capture_oneshot();
    const uint32_t ticks = timebase_ticks() - t0;
    (void)capture_settle();

    if (rc != 0u) {
        put_line(capture_overrun_aborted()
                 ? "snap: stopped by the overrun brake - this rate floods the CPU"
                 : "snap: no data");
        cmd_parser_fail();
        return;
    }
    const uint32_t window_ns = (uint32_t)(((uint64_t)ticks * 1000000000ull) / TIMEBASE_HZ);
    put_kv("samples", n);
    put_kv("window ns", window_ns);
    put_kv("ksps measured", timebase_ksps(n, ticks));
    put_kv("ksps nominal", capture_nominal_ksps(0u));
    put_kv("overrun during the burst", dma_overrun);
    put_kv("input", capture_pinsel());
    put_kv("adc core", adc_core());
}
CMD_DEFINE(snap, "snap", cmd_snap_fn, "snap - fill the buffer once and stop; then dump it");

static void cmd_rate_fn(int argc, char **argv)
{
    uint32_t want = 0u, got = 0u;
    if ((argc != 2) || !arg_u32(argv[1], 4000u, 40000u, &want)) {
        usage("rate <4000..40000 ksps>  (the closest the PLL can make; 'rate 8000' gives exactly 8000)");
        return;
    }
    const uint32_t rc = capture_set_rate(want, &got);
    put_kv("ksps asked for", want);
    put_kv("ksps set", got);
    put_kv("pll1 fbdiv", clock_pll1_fbdiv());
    put_kv("pll1 postdiv1", clock_adc_pll_postdiv1());
    put_kv("pll1 postdiv2", clock_adc_pll_postdiv2());
    put_kv("adc clock Hz", clock_adc_hz());
    put_line(clock_adc_div_error(rc));
    if (rc != CLKDIV_OK) { cmd_parser_fail(); }
}
CMD_DEFINE(rate, "rate", cmd_rate_fn, "rate <ksps> - the sample rate, 4000..40000");

/* ------------------------------------------------------------------ *
 * "blk <n>" - the sample block as binary
 *
 * `dump` prints decimal text: about 5.9 bytes per sample, so a full
 * buffer is 12 KB and takes a second at 115200 baud. The same block in
 * binary is 4 KB and 360 ms, and it arrives as one contiguous window
 * rather than a half. The frame is documented in
 * docs/PLAN-BINARY-TRANSFER.md and decoded by parse_blk_frame() in
 * tools/adc_gui.py; both ends are pinned to CRC-16/CCITT-FALSE by the
 * check value 0x29B1 of "123456789".
 *
 *   BIN n=<count> p1=<postdiv1> p2=<postdiv2> samc=<samc> in=<pinsel>CRLF
 *   <2*count bytes, uint16 little endian, 12-bit value in bits 11:0>
 *   CRLF CRC <hex4> CRLF
 *
 * The header is text so that a human on a terminal sees what is coming
 * and a machine knows exactly how many bytes to read. On failure the
 * header says n=0, no payload follows, and the command fails - the
 * client's synchronisation on the prompt and ACK/NAK does not change.
 * ------------------------------------------------------------------ */
#define BLK_CHUNK   64u              /* bytes per console_write_raw call */

