MicrochipTech/dspic33a-high-speed-adc-example/cli.c
static void cmd_blk_fn(int argc, char **argv)
{
    const uint32_t total = 2u * capture_half_len();
    uint32_t n = total;
    if ((argc > 2) || ((argc == 2) && !arg_u32(argv[1], 1u, total, &n))) {
        usage("blk [n 1..2048] - the sample block as binary, with a CRC");
        return;
    }

    /* One fresh burst, stopped by the DMA interrupt, so the block is a
     * contiguous window and not a half that the DMA is still writing. */
    const uint32_t rc = capture_oneshot();
    (void)capture_settle();

    char head[96];
    char *p = copy_str(head, "BIN n=");
    p = u32_to_str(p, (rc == 0u) ? n : 0u);
    p = copy_str(p, " p1=");   p = u32_to_str(p, clock_adc_pll_postdiv1());
    p = copy_str(p, " p2=");   p = u32_to_str(p, clock_adc_pll_postdiv2());
    p = copy_str(p, " samc="); p = u32_to_str(p, capture_samc());
    p = copy_str(p, " in=");   p = u32_to_str(p, capture_pinsel());
    copy_str(p, "\r\n");
    cmd_parser_write(head);

    if (rc != 0u) {
        cmd_parser_write("CRC 0000\r\n");
        cmd_parser_fail();
        return;
    }

    /* The payload, and the CRC computed while it goes out - no second
     * copy of the buffer anywhere. The device is little endian, so the
     * low byte of each sample is sent first, which is what the client
     * reads with dtype "<u2". */
    const volatile uint16_t *b = capture_buffer();
    uint8_t  chunk[BLK_CHUNK];
    uint16_t crc  = CRC16_INIT;
    uint32_t sent = 0u;
    for (uint32_t i = 0; i < n; ) {
        uint32_t k = 0u;
        while ((k < (BLK_CHUNK - 1u)) && (i < n)) {
            const uint16_t v = b[i++];
            chunk[k++] = (uint8_t)(v & 0xFFu);
            chunk[k++] = (uint8_t)((v >> 8) & 0x0Fu);   /* 12-bit result */
        }
        crc = crc16_ccitt_false(crc, chunk, k);
        sent += (uint32_t)console_write_raw(chunk, k);
        if (cmd_parser_aborted()) { break; }
    }

    char tail[32];
    p = copy_str(tail, "\r\nCRC ");
    for (int d = 12; d >= 0; d -= 4) {
        const uint32_t nib = ((uint32_t)crc >> d) & 0xFu;
        *p++ = (char)((nib < 10u) ? ('0' + nib) : ('A' + (nib - 10u)));
    }
    copy_str(p, "\r\n");
    cmd_parser_write(tail);

    /* A short block is not a protocol error - the client compares the
     * byte count against the header and says so - but it is not a
     * success either. */
    if (sent != (2u * n)) { cmd_parser_fail(); }
}
CMD_DEFINE(blk, "blk", cmd_blk_fn, "blk [n] - the sample block as binary, with a CRC");

/* ------------------------------------------------------------------ *
 * "stream grab" - one halt/transfer/restart cycle for the GUI
 *
 * With "stream on" already running (chaintest.c): halts the trigger,
 * sends the half that stood still as one contiguous binary block - same
 * framing as "blk", a different header - and restarts the SAME trigger.
 * docs/PLAN-BINARY-TRANSFER.md's frame, extended with what "blk" has no
 * need of but a repeating GUI cycle does: the actual rate, where in the
 * raw buffer the window starts, the stream counters since the PREVIOUS
 * grab, and the DAC triangle setting the GUI's model needs:
 *
 *   GRAB n=<count> from=<from> ksps=<ksps> ov=<overrun> late=<late>
 *        missed=<missed> halves=<halves> xfer=<transfers> slp=<slpdat>
 *        dachz=<dac_hz>CRLF
 *   <2*count bytes, uint16 little endian, 12-bit value in bits 11:0>
 *   CRLF CRC <hex4> CRLF
 *
 * On failure (no stream on, or the halt/restart itself failed) the
 * header says n=0 and every other field 0, no payload follows, and the
 * command fails - the client's synchronisation on the prompt and
 * ACK/NAK does not change, exactly as for "blk" with a refused block.
 * The restart (chain_stream_grab_end()) always runs, whether the
 * transfer went out whole or was cut short by Ctrl+C or a disconnect: a
 * short block is for the client to report, not a reason to leave the
 * chain half-configured (docs/PLAN-BINARY-TRANSFER.md's Ctrl+C risk,
 * the same one "blk" already has to live with). */
static void cmd_stream_grab(void)
{
    chain_grab_t g;
    const bool got = chain_stream_grab_begin(&g);

    char head[128];
    char *p = copy_str(head, "GRAB n=");
    p = u32_to_str(p, got ? g.win_len : 0u);
    p = copy_str(p, " from=");   p = u32_to_str(p, got ? g.from : 0u);
    p = copy_str(p, " ksps=");   p = u32_to_str(p, got ? g.ksps : 0u);
    p = copy_str(p, " ov=");     p = u32_to_str(p, got ? g.overrun : 0u);
    p = copy_str(p, " late=");   p = u32_to_str(p, got ? g.late : 0u);
    p = copy_str(p, " missed="); p = u32_to_str(p, got ? g.missed : 0u);
    p = copy_str(p, " halves="); p = u32_to_str(p, got ? g.halves : 0u);
    p = copy_str(p, " xfer=");   p = u32_to_str(p, got ? g.transfers : 0u);
    p = copy_str(p, " slp=");    p = u32_to_str(p, got ? g.slpdat : 0u);
    p = copy_str(p, " dachz=");  p = u32_to_str(p, got ? g.dac_hz : 0u);
    copy_str(p, "\r\n");
    cmd_parser_write(head);

    if (!got) {
        cmd_parser_write("CRC 0000\r\n");
        cmd_parser_fail();
        return;
    }

    const uint32_t n = g.win_len;
    uint8_t  chunk[BLK_CHUNK];
    uint16_t crc  = CRC16_INIT;
    uint32_t sent = 0u;
    for (uint32_t i = 0; i < n; ) {
        uint32_t k = 0u;
        while ((k < (BLK_CHUNK - 1u)) && (i < n)) {
            const uint16_t v = g.win[i++];
            chunk[k++] = (uint8_t)(v & 0xFFu);
            chunk[k++] = (uint8_t)((v >> 8) & 0x0Fu);   /* 12-bit result */
        }
        crc = crc16_ccitt_false(crc, chunk, k);
        sent += (uint32_t)console_write_raw(chunk, k);
        if (cmd_parser_aborted()) { break; }
    }

    char tail[32];
    p = copy_str(tail, "\r\nCRC ");
    for (int d = 12; d >= 0; d -= 4) {
        const uint32_t nib = ((uint32_t)crc >> d) & 0xFu;
        *p++ = (char)((nib < 10u) ? ('0' + nib) : ('A' + (nib - 10u)));
    }
    copy_str(p, "\r\n");
    cmd_parser_write(tail);

    /* Restart unconditionally - see the comment above. */
    const bool resumed = chain_stream_grab_end();
    if ((sent != (2u * n)) || !resumed) { cmd_parser_fail(); }
}

